; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport two-cities-sequential-5nodes-1000size-5degree-100mindistance-2trucks-6packages-1164seed

(define (problem transport-two-cities-sequential-5nodes-1000size-5degree-100mindistance-2trucks-6packages-1164seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  city-1-loc-5 - location
  city-2-loc-5 - location
  truck-1 - vehicle
  truck-2 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  package-5 - package
  package-6 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 771,110 -> 170,227
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 62)
  ; 170,227 -> 771,110
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 62)
  ; 771,110 -> 861,156
  (road city-1-loc-3 city-1-loc-2)
  (= (road-length city-1-loc-3 city-1-loc-2) 11)
  ; 861,156 -> 771,110
  (road city-1-loc-2 city-1-loc-3)
  (= (road-length city-1-loc-2 city-1-loc-3) 11)
  ; 299,14 -> 170,227
  (road city-1-loc-4 city-1-loc-1)
  (= (road-length city-1-loc-4 city-1-loc-1) 25)
  ; 170,227 -> 299,14
  (road city-1-loc-1 city-1-loc-4)
  (= (road-length city-1-loc-1 city-1-loc-4) 25)
  ; 299,14 -> 861,156
  (road city-1-loc-4 city-1-loc-2)
  (= (road-length city-1-loc-4 city-1-loc-2) 58)
  ; 861,156 -> 299,14
  (road city-1-loc-2 city-1-loc-4)
  (= (road-length city-1-loc-2 city-1-loc-4) 58)
  ; 299,14 -> 771,110
  (road city-1-loc-4 city-1-loc-3)
  (= (road-length city-1-loc-4 city-1-loc-3) 49)
  ; 771,110 -> 299,14
  (road city-1-loc-3 city-1-loc-4)
  (= (road-length city-1-loc-3 city-1-loc-4) 49)
  ; 192,428 -> 170,227
  (road city-1-loc-5 city-1-loc-1)
  (= (road-length city-1-loc-5 city-1-loc-1) 21)
  ; 170,227 -> 192,428
  (road city-1-loc-1 city-1-loc-5)
  (= (road-length city-1-loc-1 city-1-loc-5) 21)
  ; 192,428 -> 771,110
  (road city-1-loc-5 city-1-loc-3)
  (= (road-length city-1-loc-5 city-1-loc-3) 67)
  ; 771,110 -> 192,428
  (road city-1-loc-3 city-1-loc-5)
  (= (road-length city-1-loc-3 city-1-loc-5) 67)
  ; 192,428 -> 299,14
  (road city-1-loc-5 city-1-loc-4)
  (= (road-length city-1-loc-5 city-1-loc-4) 43)
  ; 299,14 -> 192,428
  (road city-1-loc-4 city-1-loc-5)
  (= (road-length city-1-loc-4 city-1-loc-5) 43)
  ; 2260,745 -> 2132,255
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 51)
  ; 2132,255 -> 2260,745
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 51)
  ; 2260,745 -> 2619,833
  (road city-2-loc-3 city-2-loc-2)
  (= (road-length city-2-loc-3 city-2-loc-2) 37)
  ; 2619,833 -> 2260,745
  (road city-2-loc-2 city-2-loc-3)
  (= (road-length city-2-loc-2 city-2-loc-3) 37)
  ; 2986,727 -> 2619,833
  (road city-2-loc-4 city-2-loc-2)
  (= (road-length city-2-loc-4 city-2-loc-2) 39)
  ; 2619,833 -> 2986,727
  (road city-2-loc-2 city-2-loc-4)
  (= (road-length city-2-loc-2 city-2-loc-4) 39)
  ; 2009,412 -> 2132,255
  (road city-2-loc-5 city-2-loc-1)
  (= (road-length city-2-loc-5 city-2-loc-1) 20)
  ; 2132,255 -> 2009,412
  (road city-2-loc-1 city-2-loc-5)
  (= (road-length city-2-loc-1 city-2-loc-5) 20)
  ; 2009,412 -> 2260,745
  (road city-2-loc-5 city-2-loc-3)
  (= (road-length city-2-loc-5 city-2-loc-3) 42)
  ; 2260,745 -> 2009,412
  (road city-2-loc-3 city-2-loc-5)
  (= (road-length city-2-loc-3 city-2-loc-5) 42)
  ; 861,156 <-> 2009,412
  (road city-1-loc-2 city-2-loc-5)
  (= (road-length city-1-loc-2 city-2-loc-5) 118)
  (road city-2-loc-5 city-1-loc-2)
  (= (road-length city-2-loc-5 city-1-loc-2) 118)
  (at package-1 city-1-loc-1)
  (at package-2 city-1-loc-5)
  (at package-3 city-1-loc-4)
  (at package-4 city-1-loc-4)
  (at package-5 city-1-loc-4)
  (at package-6 city-1-loc-4)
  (at truck-1 city-2-loc-2)
  (capacity truck-1 capacity-4)
  (at truck-2 city-2-loc-5)
  (capacity truck-2 capacity-2)
 )
 (:goal (and
  (at package-1 city-2-loc-3)
  (at package-2 city-2-loc-1)
  (at package-3 city-2-loc-1)
  (at package-4 city-2-loc-3)
  (at package-5 city-2-loc-3)
  (at package-6 city-2-loc-4)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-2 city-2-loc-5 city-1-loc-2)
   deleted: (at truck-2 city-2-loc-5)
   added: (at truck-2 city-1-loc-2)
   goals met: 0 of 6
2. (drive truck-2 city-1-loc-2 city-1-loc-4)
   deleted: (at truck-2 city-1-loc-2)
   added: (at truck-2 city-1-loc-4)
   goals met: 0 of 6
3. (pick-up truck-2 city-1-loc-4 package-6 capacity-1 capacity-2)
   deleted: (at package-6 city-1-loc-4) (capacity truck-2 capacity-2)
   added: (in package-6 truck-2) (capacity truck-2 capacity-1)
   goals met: 0 of 6
4. (pick-up truck-2 city-1-loc-4 package-4 capacity-0 capacity-1)
   deleted: (at package-4 city-1-loc-4) (capacity truck-2 capacity-1)
   added: (in package-4 truck-2) (capacity truck-2 capacity-0)
   goals met: 0 of 6
5. (drive truck-1 city-2-loc-2 city-2-loc-3)
   deleted: (at truck-1 city-2-loc-2)
   added: (at truck-1 city-2-loc-3)
   goals met: 0 of 6
6. (drive truck-1 city-2-loc-3 city-2-loc-5)
   deleted: (at truck-1 city-2-loc-3)
   added: (at truck-1 city-2-loc-5)
   goals met: 0 of 6
7. (drive truck-1 city-2-loc-5 city-1-loc-2)
   deleted: (at truck-1 city-2-loc-5)
   added: (at truck-1 city-1-loc-2)
   goals met: 0 of 6
8. (drive truck-1 city-1-loc-2 city-1-loc-4)
   deleted: (at truck-1 city-1-loc-2)
   added: (at truck-1 city-1-loc-4)
   goals met: 0 of 6
9. (pick-up truck-1 city-1-loc-4 package-5 capacity-3 capacity-4)
   deleted: (at package-5 city-1-loc-4) (capacity truck-1 capacity-4)
   added: (in package-5 truck-1) (capacity truck-1 capacity-3)
   goals met: 0 of 6
10. (pick-up truck-1 city-1-loc-4 package-3 capacity-2 capacity-3)
   deleted: (at package-3 city-1-loc-4) (capacity truck-1 capacity-3)
   added: (in package-3 truck-1) (capacity truck-1 capacity-2)
   goals met: 0 of 6
11. (drive truck-1 city-1-loc-4 city-1-loc-5)
   deleted: (at truck-1 city-1-loc-4)
   added: (at truck-1 city-1-loc-5)
   goals met: 0 of 6
12. (pick-up truck-1 city-1-loc-5 package-2 capacity-1 capacity-2)
   deleted: (at package-2 city-1-loc-5) (capacity truck-1 capacity-2)
   added: (in package-2 truck-1) (capacity truck-1 capacity-1)
   goals met: 0 of 6
13. (drive truck-1 city-1-loc-5 city-1-loc-1)
   deleted: (at truck-1 city-1-loc-5)
   added: (at truck-1 city-1-loc-1)
   goals met: 0 of 6
14. (pick-up truck-1 city-1-loc-1 package-1 capacity-0 capacity-1)
   deleted: (at package-1 city-1-loc-1) (capacity truck-1 capacity-1)
   added: (in package-1 truck-1) (capacity truck-1 capacity-0)
   goals met: 0 of 6
15. (drive truck-2 city-1-loc-4 city-1-loc-2)
   deleted: (at truck-2 city-1-loc-4)
   added: (at truck-2 city-1-loc-2)
   goals met: 0 of 6
16. (drive truck-2 city-1-loc-2 city-2-loc-5)
   deleted: (at truck-2 city-1-loc-2)
   added: (at truck-2 city-2-loc-5)
   goals met: 0 of 6
17. (drive truck-2 city-2-loc-5 city-2-loc-3)
   deleted: (at truck-2 city-2-loc-5)
   added: (at truck-2 city-2-loc-3)
   goals met: 0 of 6
18. (drop truck-2 city-2-loc-3 package-4 capacity-0 capacity-1)
   deleted: (in package-4 truck-2) (capacity truck-2 capacity-0)
   added: (at package-4 city-2-loc-3) (capacity truck-2 capacity-1)
   goals met: 1 of 6
19. (drive truck-2 city-2-loc-3 city-2-loc-2)
   deleted: (at truck-2 city-2-loc-3)
   added: (at truck-2 city-2-loc-2)
   goals met: 1 of 6
20. (drive truck-2 city-2-loc-2 city-2-loc-4)
   deleted: (at truck-2 city-2-loc-2)
   added: (at truck-2 city-2-loc-4)
   goals met: 1 of 6
21. (drive truck-1 city-1-loc-1 city-1-loc-3)
   deleted: (at truck-1 city-1-loc-1)
   added: (at truck-1 city-1-loc-3)
   goals met: 1 of 6
22. (drive truck-1 city-1-loc-3 city-1-loc-2)
   deleted: (at truck-1 city-1-loc-3)
   added: (at truck-1 city-1-loc-2)
   goals met: 1 of 6
23. (drive truck-1 city-1-loc-2 city-2-loc-5)
   deleted: (at truck-1 city-1-loc-2)
   added: (at truck-1 city-2-loc-5)
   goals met: 1 of 6
24. (drive truck-1 city-2-loc-5 city-2-loc-1)
   deleted: (at truck-1 city-2-loc-5)
   added: (at truck-1 city-2-loc-1)
   goals met: 1 of 6
25. (drop truck-1 city-2-loc-1 package-2 capacity-0 capacity-1)
   deleted: (in package-2 truck-1) (capacity truck-1 capacity-0)
   added: (at package-2 city-2-loc-1) (capacity truck-1 capacity-1)
   goals met: 2 of 6
26. (drop truck-1 city-2-loc-1 package-3 capacity-1 capacity-2)
   deleted: (in package-3 truck-1) (capacity truck-1 capacity-1)
   added: (at package-3 city-2-loc-1) (capacity truck-1 capacity-2)
   goals met: 3 of 6
27. (drive truck-1 city-2-loc-1 city-2-loc-3)
   deleted: (at truck-1 city-2-loc-1)
   added: (at truck-1 city-2-loc-3)
   goals met: 3 of 6
28. (drop truck-1 city-2-loc-3 package-1 capacity-2 capacity-3)
   deleted: (in package-1 truck-1) (capacity truck-1 capacity-2)
   added: (at package-1 city-2-loc-3) (capacity truck-1 capacity-3)
   goals met: 4 of 6
29. (drop truck-1 city-2-loc-3 package-5 capacity-3 capacity-4)
   deleted: (in package-5 truck-1) (capacity truck-1 capacity-3)
   added: (at package-5 city-2-loc-3) (capacity truck-1 capacity-4)
   goals met: 5 of 6
30. (drop truck-2 city-2-loc-4 package-6 capacity-1 capacity-2)
   deleted: (in package-6 truck-2) (capacity truck-2 capacity-1)
   added: (at package-6 city-2-loc-4) (capacity truck-2 capacity-2)
   goals met: 6 of 6
